{
  "name": "Turret Assembly Upgrades",
  "icon": "sapturretmod:assembly_upg_auto",
  "category": "sapturretmod:misc",
  "pages": [
    {
      "type": "sapturretmod:spotlight_multi",
      "item": "sapturretmod:assembly_upg_speed,sapturretmod:assembly_upg_auto,sapturretmod:assembly_upg_filter,sapturretmod:assembly_upg_redstone",
      "title": "T. Assembly Upgrades",
      "text": "The following upgrades allow you to augment the $(l:misc/turret_assembly)assembly table$(/l) in different ways. Just place the upgrade of choice in the upgrade slots of the assembly table UI. Once inserted, its functionality is immediately available."
    },
    {
      "type": "image",
      "images": ["sapturretmod:textures/gui/lexicon/assembly/full_upgraded.png"],
      "border": true,
      "text": "$(italic)The turret assembly as it appears in world when fully upgraded$()"
    },
    {
      "type": "text",
      "title": "Speed Upgrade",
      "text": "This will increase the crafting speed, making it 4 times faster. Be careful, though, not only will this increase the consumption of energy units per second, but adds a 10% penalty to it as well."
    },
    {
      "type": "sapturretmod:turret_assembly_i18n",
      "recipe": "sapturretmod:upgrades/assembly_speed"
    },
    {
      "type": "text",
      "title": "Automation Upgrade",
      "text": "If you want to automatically craft one specific recipe indefinitely, use this upgrade and two new buttons will appear inside the assembly table UI: \"Manual\", which is the standard behavior, and \"Automate\".$(br)Once automation is activated and a recipe is selected, instead of showing the amount of crafting operations, it'll show an infinity symbol and tries to craft until you cancel the crafting yourself."
    },
    {
      "type": "sapturretmod:turret_assembly_i18n",
      "recipe": "sapturretmod:upgrades/assembly_auto"
    },
    {
      "type": "text",
      "title": "Filter Upgrade",
      "text": "Filters items into specific slots within the turret assembly. To configure it, hold it and right-click whilst sneaking. This will open up a UI representing the input slots. Put the item(s) of choice inside (these will not be consumed). Now, if you put that into the upgrade slot, it will prevent anything other than the filtered items from being inserted into their slots. Empty slots accept anything that is not filtered already."
    },
    {
      "type": "sapturretmod:turret_assembly_i18n",
      "recipe": "sapturretmod:upgrades/assembly_filter"
    },
    {
      "type": "text",
      "title": "Redstone Upgrade",
      "text": "Control the turret assembly with this via a redstone signal. When the turret assembly is powered, it will pause any crafting it currently is processing.$(br2)The block can be controlled from pretty much any side"
    },
    {
      "type": "sapturretmod:turret_assembly_i18n",
      "recipe": "sapturretmod:upgrades/assembly_redstone"
    }
  ]
}